In [1]:
import pandas as pd
import numpy as np

In [2]:
#Import the data
data = pd.read_csv('/Users/beejalparekh/Desktop/Bootcamp/_DA_course/_DA-project_/Datasets/Eurostat/Population by educational attainment level.csv')
data.head()

,DATAFLOW,LAST UPDATE,freq,unit,sex,isced11,age,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG,CONF_STATUS
0,ESTAT:EDAT_LFS_9903(1.0),12/12/24 23:00:00,Annual,Percentage,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2004,74.9,NaN,NaN
1,ESTAT:EDAT_LFS_9903(1.0),12/12/24 23:00:00,Annual,Percentage,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2005,77.1,NaN,NaN
2,ESTAT:EDAT_LFS_9903(1.0),12/12/24 23:00:00,Annual,Percentage,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2006,81.2,b,NaN
3,ESTAT:EDAT_LFS_9903(1.0),12/12/24 23:00:00,Annual,Percentage,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2007,82.0,NaN,NaN
4,ESTAT:EDAT_LFS_9903(1.0),12/12/24 23:00:00,Annual,Percentage,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2008,81.8,NaN,NaN

In [3]:
data.shape

(242934, 12)

In [4]:
data.columns

Index(['DATAFLOW', 'LAST UPDATE', 'freq', 'unit', 'sex', 'isced11', 'age',
       'geo', 'TIME_PERIOD', 'OBS_VALUE', 'OBS_FLAG', 'CONF_STATUS'],
      dtype='object')

In [18]:
# Check the number of unique values in columns 
print('Number of unique values in each column:')
for i in data.columns:
    print(i,':', data[i].nunique())

Number of unique values in each column:
DATAFLOW : 1
LAST UPDATE : 1
freq : 1
unit : 1
sex : 3
isced11 : 6
age : 25
geo : 38
TIME_PERIOD : 20
OBS_VALUE : 985
OBS_FLAG : 5
CONF_STATUS : 0

In [19]:
# Delete columns with 0 or 1 unqiue value
data = data.loc[:, data.nunique() > 1]

In [21]:
data.head()

,sex,isced11,age,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2004,74.9,NaN
1,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2005,77.1,NaN
2,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2006,81.2,b
3,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2007,82.0,NaN
4,Females,"Less than primary, primary and lower secondary...",From 15 to 19 years,Austria,2008,81.8,NaN